{
  "articles": [
    {
      "title": "सूखा प्रतिरोधी फसल किस्में जारी की गईं",
      "description": "वैज्ञानिकों ने गेहूं और चावल की नई सूखा प्रतिरोधी किस्में विकसित की हैं जो उच्च उपज बनाए रखते हुए गंभीर पानी की कमी की स्थिति का सामना कर सकती हैं। ये किस्में शुष्क क्षेत्रों में किसानों को अपनी उत्पादकता में काफी सुधार करने में मदद कर सकती हैं।",
      "publishedAt": "2023-10-15T09:30:00Z",
      "url": "https://example.com/farming-news/drought-resistant-crops",
      "source": "कृषि विज्ञान पत्रिका",
      "image": "/images/news/drought-crops.jpg"
    },
    {
      "title": "सरकार ने जैविक खेती के लिए बढ़ी सब्सिडी की घोषणा की",
      "description": "कृषि मंत्रालय ने जैविक खेती पद्धतियों में परिवर्तन करने वाले किसानों के लिए सब्सिडी में 25% की वृद्धि की घोषणा की है। इस पहल का उद्देश्य स्थायी कृषि प्रथाओं को बढ़ावा देना और देश भर में मिट्टी के स्वास्थ्य में सुधार करना है।",
      "publishedAt": "2023-10-10T14:15:00Z",
      "url": "https://example.com/farming-news/organic-subsidy",
      "source": "राष्ट्रीय कृषि समाचार",
      "image": "/images/news/organic-farming.jpg"
    },
    {
      "title": "नया मोबाइल ऐप किसानों को मिट्टी के स्वास्थ्य की निगरानी में मदद करता है",
      "description": "एक नया स्मार्टफोन एप्लिकेशन लॉन्च किया गया है जो किसानों को अपने फोन के कैमरे का उपयोग करके मिट्टी के स्वास्थ्य का विश्लेषण करने की अनुमति देता है। ऐप पोषक तत्वों की कमी का पता लगाने के लिए AI का उपयोग करता है और मिट्टी के उपचार के लिए सिफारिशें प्रदान करता है।",
      "publishedAt": "2023-10-05T11:45:00Z",
      "url": "https://example.com/farming-news/soil-app",
      "source": "कृषि प्रौद्योगिकी आज",
      "image": "/images/news/soil-app.jpg"
    },
    {
      "title": "मौसम पूर्वानुमान ने अच्छे मानसून की भविष्यवाणी की",
      "description": "मौसम विभाग ने आगामी मानसून के दौरान औसत से अधिक वर्षा की भविष्यवाणी की है। किसानों को एक अच्छे बुवाई के मौसम के लिए तैयार रहने की सलाह दी जाती है, जिसमें कृषि क्षेत्रों में वर्षा का अच्छी तरह से वितरण होने की उम्मीद है।",
      "publishedAt": "2023-10-01T08:00:00Z",
      "url": "https://example.com/farming-news/monsoon-forecast",
      "source": "मौसम ब्यूरो",
      "image": "/images/news/monsoon.jpg"
    }
  ]
} 